RhinoInside.Revit API Documentation
GeometryEncoder.ToArc Method (Arc)
 Converts the specified Arc to an equivalent Revit Arc.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.Arc ToArc(
	this Rhino.Geometry.Arc value
)
@staticmethod
def ToArc(
	value: Rhino.Geometry.Arc
) -> Autodesk.Revit.DB.Arc
Parameters
value
Type: Rhino.Geometry.Arc
A value to convert.
Return Value
Type: Autodesk.Revit.DB.Arc
A Revit Arc that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Arc. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToArc Overload
RhinoInside.Revit.Convert.Geometry Namespace